Repository: pcbimon/FlipPDF
Catalog: lib/l10n/app_*.arb
Languages: th

source: Select PDF File
th: เลือกไฟล์ PDF

# selectPDFToView
source: Select a PDF file to view as a Flipbook
th: เลือกไฟล์ PDF เพื่อเปิดดูในรูปแบบ Flipbook

# screenWillStayOn
source: Screen will stay on during use
th: หน้าจอจะไม่ปิดระหว่างใช้งาน

# selectPDFButton
source: Select PDF File
th: เลือกไฟล์ PDF

# selectedFile
source: Selected file: {fileName}
th: ไฟล์ที่เลือก: {fileName}

source: Open PDF Flipbook
th: เปิด PDF Flipbook

# errorOccurred
source: An error occurred: {error}
th: เกิดข้อผิดพลาด: {error}

# pdfNotFound
source: PDF file not found
th: ไม่พบไฟล์ PDF

# cannotProcessPDF
source: Cannot process PDF file
th: ไม่สามารถประมวลผล PDF ได้

source: Processing...
th: กำลังประมวลผล...

# lowQuality
source: Low Quality (Fast)
th: คุณภาพต่ำ (เร็ว)

source: Medium Quality
th: คุณภาพปานกลาง

source: High Quality
th: คุณภาพสูง

source: Cache Options
th: ตัวเลือก Cache

source: Clear Memory Cache
th: ล้าง Memory Cache

source: Clear Disk Cache
th: ล้าง Disk Cache

source: Memory cache cleared
th: ล้าง Memory Cache แล้ว

source: Disk cache cleared
th: ล้าง Disk Cache แล้ว

source: Close
th: ปิด

source: Back
th: กลับ

# pdfFileNotExist
source: PDF file does not exist in the system
th: ไฟล์ PDF ไม่มีอยู่ในระบบ

# pageError
source: Error occurred on page {page}: {error}
th: เกิดข้อผิดพลาดที่หน้า {page}: {error}

# confirmExit
source: Do you want to exit PDF viewer?
th: คุณต้องการออกจากโปรแกรมดู PDF หรือไม่?

source: Yes
th: ใช่

source: No
th: ไม่ใช่

source: Language
th: ภาษา
